org/bspwm.org
#+TITLE: Bspwm

BSPWM is a binary space partitioning window manager.

By default, it opens windows in a pattern resembling the Fibonacci sequence, but it's an incredibly configurable platform that a variety of others have written tools for.

It doesn't control its own keymappings; messaging is managed entirely by `bspc`. Users typically also use XHKD to map keys for the window manager.

* Scripts
[[https://github.com/melangue/bspwm-window-titles][Generates window title names to be used in a bar]]
[[https://github.com/phenax/bsp-layout][Provides wrappers to manage BSPWM layouts]]
