todo/content/posts/bspwm.md
+++
title = "bspwm"
author = ["Jacob Chvatal"]
lastmod = 2020-10-14T19:03:33+02:00
slug = "bspwm"
draft = false
+++

BSPWM is a binary space partitioning window manager.

By default, it opens windows in a pattern resembling the Fibonacci sequence, but it's an incredibly configurable platform that a variety of others have written tools for.

It doesn't control its own keymappings; messaging is managed entirely by \`bspc\`. Users typically also use XHKD to map keys for the window manager.


## Scripts {#scripts}

[Generates window title names to be used in a bar](https://github.com/melangue/bspwm-window-titles)
[Provides wrappers to manage BSPWM layouts](https://github.com/phenax/bsp-layout)
